## Reto 2: Convertir tablas en MySQL a `DataFrames` de `pandas`

### 1. Objetivos:
    - Solicitar todos los datos de las tablas que están almacenadas en nuestra base de datos, convertirlos a `DataFrames` y guardarlos.
    
---
    
### 2. Desarrollo:

#### a) Tablas a `DataFrames`

Ya que tenemos nuestra conexión funcionando adecuadamente, vamos a utilizarla para realizar consultas a las base de datos y construir una base de datos local. Tu Reto consiste en los siguientes pasos:

1. Vuelve a establecer la conexión a la base de datos
2. Usando el comando `SELECT * FROM nombre_de_tabla`, realiza consultas a cada una de las 5 tablas que existen en la base de datos.
3. Crea un `DataFrame` por cada tabla que obtuviste. Para asignarle los nombres de las columnas correctamente, revisa el archivo [Readme.md](../../Datasets/MovieLens/Readme.md) donde está contenida toda esa información.
4. Asegúrate de que el índice sea adecuado en cada `DataFrame`. En los casos en los que haya datos redundantes, convierte una de las columnas en índice.
5. Si lo deseas ordena las columnas de la manera en la que mejor te parezca.
6. Guarda tus `DataFrames` en formato .csv para utilizarlos en los siguientes Retos.

> **NOTA IMPORTANTE**: La tabla movies es un poco complicada porque contiene muchos signos distintos. Tanto en la columna de nombre de película como la de género, encontramos signos como `,`, `:`, `.`, `|`. Esto hace un poco complicado el almacenamiento y lectura de este archivo. Si elijes guardar este archivo como un .csv separado por comas (`,`), a la hora de leerlo de regreso, `pandas` puede confundirse y pensar que el título de una película que contiene comas constituye dos columnas. Por esta razón, te recomiendo que la tabla `movies` la guardes agregando un separador poco convencional como `sep='$'`. De esta manera será muchísimo más fácil leer tu archivo de regreso usando ese separador.

In [6]:
# Tu código va a aquí
!pip install mysql-connector-python

import pandas as pd

Requirement already satisfied: mysql-connector-python in /usr/local/lib/python3.7/dist-packages (8.0.26)
Requirement already satisfied: protobuf>=3.0.0 in /usr/local/lib/python3.7/dist-packages (from mysql-connector-python) (3.17.3)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.7/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)

In [2]:
import mysql.connector
cnx = mysql.connector.connect(
    host = "ec2-34-222-235-52.us-west-2.compute.amazonaws.com",
    port = 3306,
    user = "data",
    password = "khQ9--mp6LWq97iA",
    database = "movielens"
)

In [3]:
cursor = cnx.cursor()

cursor.execute("SHOW TABLES")

In [4]:
result = cursor.fetchall()
result

[('age_ranges',), ('movies',), ('occupations',), ('ratings',), ('users',)]

In [5]:
cursor.execute("SELECT * FROM age_ranges")

result = cursor.fetchall()

In [14]:
df_1 = pd.DataFrame(result,columns=["AgeID","AgeRange"])

df_1.head()

   AgeID  AgeRange
0      1  Under 18
1     18     18-24
2     25     25-34
3     35     35-44
4     45     45-49

In [15]:
cursor.execute("SELECT * FROM movies")

result = cursor.fetchall()

In [16]:
df_2 = pd.DataFrame(result,columns=["MovieID","Title","Genres"])

df_2

      MovieID                               Title                        Genres
0           1                    Toy Story (1995)   Animation|Children's|Comedy
1           2                      Jumanji (1995)  Adventure|Children's|Fantasy
2           3             Grumpier Old Men (1995)                Comedy|Romance
3           4            Waiting to Exhale (1995)                  Comedy|Drama
4           5  Father of the Bride Part II (1995)                        Comedy
...       ...                                 ...                           ...
3878     3948             Meet the Parents (2000)                        Comedy
3879     3949          Requiem for a Dream (2000)                         Drama
3880     3950                    Tigerland (2000)                         Drama
3881     3951             Two Family House (2000)                         Drama
3882     3952               Contender, The (2000)                Drama|Thriller

[3883 rows x 3 columns]

In [17]:
cursor.execute("SELECT * FROM occupations")

result = cursor.fetchall()

In [18]:
df_3 = pd.DataFrame(result,columns=["OccupationID","Description"])

df_3

    OccupationID             Description
0              0  other or not specified
1              1       academic/educator
2              2                  artist
3              3          clerical/admin
4              4    college/grad student
5              5        customer service
6              6      doctor/health care
7              7    executive/managerial
8              8                  farmer
9              9               homemaker
10            10            K-12 student
11            11                  lawyer
12            12              programmer
13            13                 retired
14            14         sales/marketing
15            15               scientist
16            16           self-employed
17            17     technician/engineer
18            18     tradesman/craftsman
19            19              unemployed
20            20                  writer

In [19]:
cursor.execute("SELECT * FROM ratings")

result = cursor.fetchall()

In [23]:
df_4 = pd.DataFrame(result,columns=["UserID","MovieID","Rating","Timestamp"])

df_4

         UserID  MovieID  Rating  Timestamp
0             1     1193       5  978300760
1             1      661       3  978302109
2             1      914       3  978301968
3             1     3408       4  978300275
4             1     2355       5  978824291
...         ...      ...     ...        ...
1000204    6040     1091       1  956716541
1000205    6040     1094       5  956704887
1000206    6040      562       5  956704746
1000207    6040     1096       4  956715648
1000208    6040     1097       4  956715569

[1000209 rows x 4 columns]

In [24]:
cursor.execute("SELECT * FROM users")

result = cursor.fetchall()

In [25]:
df_5 = pd.DataFrame(result,columns=["UserID","Gender","Age","Occupation","Zip-code"])

df_5

      UserID Gender  Age  Occupation Zip-code
0          1      F    1          10    48067
1          2      M   56          16    70072
2          3      M   25          15    55117
3          4      M   45           7    02460
4          5      M   25          20    55455
...      ...    ...  ...         ...      ...
6035    6036      F   25          15    32603
6036    6037      F   45           1    76006
6037    6038      F   56           1    14706
6038    6039      F   45           0    01060
6039    6040      M   25           6    11106

[6040 rows x 5 columns]

Compara con tus compañeros y revisa con la experta para que todos estén seguros de que tienen sus `DataFrames` estructurados de la manera correcta y que sus archivos .csv fueron creados exitosamente. Vamos a utilizar estos archivos en los Retos siguientes, así que es muy importante que tus datos estén estructurados adecuadamente.